InformationRegisters/ДанныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЭлемент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РекламацияПодряда</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтчетыБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтчетыБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СостояниеПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗ_на_согласовании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омВзаимодействиеСервер/Ext/Module.bsl
Функция ОтправкаВзаимодействиеНаПочту(Взаимодействие, ТекущийИсполнитель) Экспорт

	СписокАдресов = омРабочийСтол.СписокАдресовДляОтправкиВзаимодействия(ТекущийИсполнитель);
	
	Если ПустаяСтрока(СписокАдресов) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МассивЕмайлов = СтрРазделить(СписокАдресов, ";");
	
	СозданиеИОтправкаОповещения(МассивЕмайлов);
	
КонецФункции // ТеребуетсяОтправкаВзаимодействиеНаПочту()

Функция СозданиеИОтправкаОповещения(Взаимодействие, МассивЕмайлов = Неопределено) Экспорт 

	Если МассивЕмайлов = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиПроекта.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ДанныеЗадачи.СрезПоследних(, Задача = &Взаимодействие) КАК ДанныеЗадачиСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
			|		ПО ДанныеЗадачиСрезПоследних.Исполнитель = НастройкиПроекта.Пользователь
			|ГДЕ
			|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
		
		Запрос.УстановитьПараметр("Взаимодействие", Взаимодействие);
		Запрос.УстановитьПараметр("ИмяНастройки", омРабочийСтол.НаименованиеНастройкиДляОтправкиСообщений());
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Если Выборка.Количество() = 0 Тогда
			МассивЕмайлов = Новый Массив;
		Иначе	
			
			Пока Выборка.Следующий() Цикл
				МассивЕмайлов = СтрРазделить(Выборка.Значение, ";");
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	СтруктураПараметров = ПолучитьСтруктуруДляОтправкиПисьма();
	
	Для каждого ТекущаяНастройка Из омВзаимодействиеСерверПовтор.ПолучитьНастройкиОтправкиСообщения() Цикл
		
		Если ТекущаяНастройка.Представление = "УчетнаяЗаписьОтправкиСообщения" Тогда
			СтруктураПараметров.УчетнаяЗапись = ТекущаяНастройка.Значение;
		ИначеЕсли ТекущаяНастройка.Представление = "ТемаОтправкиСообщения" Тогда
			СтруктураПараметров.Тема = ТекущаяНастройка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Сообщение КАК СообщениеЗадачи,
		|	ЗадачиОбщие.Автор.Наименование КАК АвторНаименование,
		|	ЗадачиОбщие.Дата КАК Дата,
		|	ЗадачиОбщие.ОжидаемаяДатаВыполнения КАК ОжидаемаяДатаВыполнения,
		|	ЗадачиОбщие.КартинкаЕсть КАК КартинкаЕсть,
		|	ЕСТЬNULL(КартинкиНоменклатуры.ИмяФайла, """") КАК ИмяФайла,
		|	КартинкиНоменклатуры.Картинка КАК Картинка
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиНоменклатуры КАК КартинкиНоменклатуры
		|		ПО (КартинкиНоменклатуры.ИзделиеЭлемент = ЗадачиОбщие.Ссылка)
		|ГДЕ
		|	ЗадачиОбщие.Ссылка = &Взаимодействие";
	
	Запрос.УстановитьПараметр("Взаимодействие", Взаимодействие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров.ТексПисьма = Формат(Выборка.Дата, "ДЛФ=DDT") + Символы.ВК +
		Выборка.СообщениеЗадачи + Символы.ВК + Выборка.АвторНаименование;
		
		Если Выборка.КартинкаЕсть Тогда
			
			ДвоичныеДанные = Выборка.Картинка.Получить();
			
			Если ДвоичныеДанные <> Неопределено Тогда
				УИД = Новый УникальныйИдентификатор();
				СтруктураПараметров.АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УИД);
			КонецЕсли;
		КонецЕсли;  
		
	КонецЦикла;
	
    ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);
	

КонецФункции // СозданиеИОтправкаОповещения()


Процедура ОтправитьОповещениевФоне(Взаимодействие) Экспорт

	ПараметрыФункции 	= Новый Массив(1);
	ПараметрыФункции[0] = Взаимодействие;	
	ФоновыеЗадания.Выполнить("омВзаимодействиеСервер.СозданиеИОтправкаОповещения", ПараметрыФункции, , "ЗОтправкаОповещениеПоEMail");
	
КонецПроцедуры


Функция ПолучитьСтруктуруДляОтправкиПисьма() Экспорт

	СтруктураПараметров = Новый Структура("ИспользоватьОтчет, СобытиеОповещения, УчетнаяЗапись, Шаблон, Тема", );
	СтруктураПараметров.Вставить("Автор", 			Пользователи.ТекущийПользователь());
	СтруктураПараметров.Вставить("Ответственный", 	СтруктураПараметров.Автор);
	СтруктураПараметров.Вставить("АдресКартинки", 	Неопределено);
	СтруктураПараметров.Вставить("ТексПисьма", 		"");
	СтруктураПараметров.Вставить("ИмяКартинки", 	"");
	
	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруДляОтправвкиПисьма()     

Функция ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов) Экспорт

	Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	
	Письмо.Автор            = СтруктураПараметров.Автор;
	Письмо.Ответственный	= СтруктураПараметров.Ответственный;
	Письмо.Тема             = СтруктураПараметров.Тема;
	Письмо.Текст			= СтруктураПараметров.ТексПисьма;
	Письмо.Дата             = ТекущаяДатаСеанса();
	Письмо.ТипТекста		= Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
	
	ТипСтрока = Тип("Строка");
	
	Для каждого х Из МассивЕмайлов Цикл
	
		НС 					= Письмо.ПолучателиПисьма.Добавить();
		
		Если ТипСтрока = ТипЗнч(х) Тогда
			
			НС.Адрес 			= х;
			
		Иначе
			
			НС.Адрес 			= х.E_mail;
			НС.Представление 	= х.ПредставлениеE_mail;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ИмяФайла = "";
	
	Если СтруктураПараметров.ИспользоватьОтчет = Перечисления.ОтчетыБазы.СостояниеПроекта Тогда
		АдресОтчета = Отчеты.СостояниеПроекта.ПолучитьФайлНаСервере(, ИмяФайла);
	Иначе
		АдресОтчета = Неопределено;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;

	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Кому",         "ПолучателиПисьма");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Копии",        "ПолучателиКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"СкрытыеКопии", "ПолучателиСкрытыхКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"АдресОтвета",  "ПолучателиОтвета");
	
	ПараметрыПисьма.Вставить("Тема", Письмо.Тема);
	ПараметрыПисьма.Вставить("Тело", ?(Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст,
	                                   Письмо.Текст, Письмо.ТекстHTML));
	ПараметрыПисьма.Вставить("Кодировка", Письмо.Кодировка);
	ПараметрыПисьма.Вставить("Важность",  УправлениеЭлектроннойПочтой.ПолучитьВажность(Письмо.Важность));
	ПараметрыПисьма.Вставить("ТипТекста", Письмо.ТипТекста);
	
	Если Не ПустаяСтрока(Письмо.ИдентификаторыОснований) Тогда
		ПараметрыПисьма.Вставить("ИдентификаторыОснований", Письмо.ИдентификаторыОснований);
	КонецЕсли;
	
	МассивВложений = Новый Массив;
	
	ПараметрыПисьма.Вставить("Вложения", МассивВложений);
	ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
	
	ПараметрыПисьма.Вставить("УведомитьОДоставке", Письмо.УведомитьОДоставке); 
	ПараметрыПисьма.Вставить("УведомитьОПрочтении", Письмо.УведомитьОПрочтении);
	
	ПараметрыПисьма.Вставить("АдресОтвета", "");
	ПараметрыПисьма.Вставить("Картинки", Новый Массив);
	ПараметрыПисьма.Вставить("Вложения", Новый Массив);
	
	ПараметрыДоставки = РассылкаОтчетов.ПараметрыДоставки();
	ПараметрыДоставки.Получатели = Новый Соответствие;
	
	Для каждого х Из МассивЕмайлов Цикл    
	
		Если ТипСтрока = ТипЗнч(х) Тогда
			ПараметрыДоставки.Получатели.Вставить("", 					 х);
		Иначе
			ПараметрыДоставки.Получатели.Вставить(х.ПредставлениеE_mail, х.E_mail);
		КонецЕсли;
	
	КонецЦикла;
	
	Сообщение1 = РассылкаОтчетов.ПараметрыСообщенияДляПодсистемыВзаимодействия(ПараметрыДоставки, ПараметрыПисьма);
	
	Если ЗначениеЗаполнено(АдресОтчета) Тогда
		
		СтрокаВложение 								= Сообщение1.Вложения.Добавить();
		СтрокаВложение.АдресВоВременномХранилище 	= АдресОтчета;
		СтрокаВложение.Представление 				= ИмяФайла;
	
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.АдресКартинки = Неопределено Тогда
		
		СтрокаВложение 								= Сообщение1.Вложения.Добавить();
		СтрокаВложение.АдресВоВременномХранилище 	= СтруктураПараметров.АдресКартинки;
		СтрокаВложение.Представление 				= СтруктураПараметров.ИмяКартинки;
	
	КонецЕсли;
	
	РезультатОтправки = Взаимодействия.СоздатьПисьмо(Сообщение1, СтруктураПараметров.УчетнаяЗапись, Истина);
	

КонецФункции // ОтправитьСообщение()


Функция ПолучитьПеречислениеДеньНедели(ТД = Неопределено) Экспорт

	НомерНедели = ДеньНедели(?(ТД = Неопределено, ТекущаяДата(), ТД));	
	
	Если НомерНедели = 1 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Понедельник;
	ИначеЕсли НомерНедели = 2 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Вторник;
	ИначеЕсли НомерНедели = 3 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Среда;
	ИначеЕсли НомерНедели = 4 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Четверг;
	ИначеЕсли НомерНедели = 5 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Пятница;
	ИначеЕсли НомерНедели = 6 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Суббота;
	ИначеЕсли НомерНедели = 7 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Воскресение;
	КонецЕсли;
	
	Возврат ЗначениеДнянедели;

КонецФункции // ПолучитьПеречислениеДеньНедели()
